Documents/УказаниеОбъектовАренды_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УказаниеОбъектовАренды_ат</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДоступностьАренды_ат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыАренды_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаблокироватьАренду</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПередачиВАренду</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПередачиВАренду_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Серверы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сервер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Серверы_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РолиСерверов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольСервера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиСерверов_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоставкиПродуктов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоставкаПродукта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоставкиПродуктов_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОграниченныйСписокКлиентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДоступностьАренды_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДоступностьАренды_ат</Name>
			<Comment>!!!!!HOTFIX + переименовать в История..</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АрендаРазрешена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыАренды_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СубъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставкиПродуктов_ат</v8:Type>
						<v8:Type>cfg:CatalogRef.РолиСерверов_ат</v8:Type>
						<v8:Type>cfg:CatalogRef.Серверы_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УказаниеОбъектовАренды_ат/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЕстьНеВведенныеВключенныеОбъектыАренды() Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ не может быть проведён т.к. не все Объекты аренды включённые в выбранный Объект аренды были введены ранее.";
		Сообщение.Сообщить(); 
		
		Возврат;
		
	КонецЕсли;
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//	"";
	//	
	//Запрос.УстановитьПараметр("", );
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//
	//	
	//
	//КонецЦикла;
	 
	
КонецПроцедуры

Функция   ЕстьНеВведенныеВключенныеОбъектыАренды()
	
	Если ОбъектАренды.ВключенныеОбъектыАренды.Количество() = 0 Тогда
		
		Возврат Ложь;
		
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДоступностьАренды_атСрезПоследних.ОбъектАренды
			|ИЗ
			|	РегистрСведений.ДоступностьАренды_ат.СрезПоследних(
			|			&Период,
			|			ОбъектАренды В (&ОбъектыАренды)
			|				И АрендаРазрешена
			|				И (Клиент В (&Клиенты)
			|					ИЛИ Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты_ат.ПустаяСсылка))) КАК ДоступностьАренды_атСрезПоследних";
			
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("ОбъектыАренды", ОбъектАренды.ВключенныеОбъектыАренды.ВыгрузитьКолонку("ОбъектАренды"));
		Запрос.УстановитьПараметр("Клиенты", ОграниченныйСписокКлиентов.ВыгрузитьКолонку("Клиент"));
		
		Возврат НЕ Запрос.Выполнить().Пустой();
		
	КонецЕсли;
	
КонецФункции
